{
  "_name_or_path": "WinKawaks/vit-tiny-patch16-224",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 192,
  "id2label": {
    "0": "1. Address",
    "1": "2. Toe-up",
    "2": "3. Mid-backswing",
    "3": "4. Top",
    "4": "5. Impact",
    "5": "6. Mid-follow-through",
    "6": "7. Finish"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 768,
  "label2id": {
    "1. Address": "0",
    "2. Toe-up": "1",
    "3. Mid-backswing": "2",
    "4. Top": "3",
    "5. Impact": "4",
    "6. Mid-follow-through": "5",
    "7. Finish": "6"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 3,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.31.0"
}
